cask_args appdir: '/Applications'

tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'git'
brew 'lima'
brew 'docker', link: false
brew 'docker-compose', link: false
brew 'awscli'
brew 'aws-vault'
brew 'jump'
brew 'gh'

cask 'visual-studio-code'
cask 'google-chrome'
cask 'firefox'
cask 'arc'
cask 'obsidian'
cask 'iterm2'
cask 'warp'
cask 'raycast'
cask 'zoom'
cask 'tandem'
cask 'keepassxc'
cask 'slack'
cask 'phpstorm'
cask 'obs'
cask 'amethyst'